layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.0078431372549
    crop_size: 224
    mean_value: 127.5
    mean_value: 127.5
    mean_value: 127.5
  }
  data_param {
    source: "/media/data/data/ilsvrc12_train_lmdb"
    batch_size: 16
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.0078431372549
    crop_size: 224
    mean_value: 127.5
    mean_value: 127.5
    mean_value: 127.5
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 25
    backend: LMDB
  }
}
layer {
  name: "stem1"
  type: "Convolution"
  bottom: "data"
  top: "stem1"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stem1/bn"
  type: "BatchNorm"
  bottom: "stem1"
  top: "stem1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stem1/scale"
  type: "Scale"
  bottom: "stem1"
  top: "stem1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stem1/relu"
  type: "ReLU"
  bottom: "stem1"
  top: "stem1"
}
layer {
  name: "stem2a"
  type: "Convolution"
  bottom: "stem1"
  top: "stem2a"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stem2a/bn"
  type: "BatchNorm"
  bottom: "stem2a"
  top: "stem2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stem2a/scale"
  type: "Scale"
  bottom: "stem2a"
  top: "stem2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stem2a/relu"
  type: "ReLU"
  bottom: "stem2a"
  top: "stem2a"
}
layer {
  name: "stem2b"
  type: "Convolution"
  bottom: "stem2a"
  top: "stem2b"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stem2b/bn"
  type: "BatchNorm"
  bottom: "stem2b"
  top: "stem2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stem2b/scale"
  type: "Scale"
  bottom: "stem2b"
  top: "stem2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stem2b/relu"
  type: "ReLU"
  bottom: "stem2b"
  top: "stem2b"
}
layer {
  name: "stem/pool"
  type: "Pooling"
  bottom: "stem1"
  top: "stem/pool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "stem/concat"
  type: "Concat"
  bottom: "stem/pool"
  bottom: "stem2b"
  top: "stem/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stem3"
  type: "Convolution"
  bottom: "stem/concat"
  top: "stem3"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stem3/bn"
  type: "BatchNorm"
  bottom: "stem3"
  top: "stem3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stem3/scale"
  type: "Scale"
  bottom: "stem3"
  top: "stem3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stem3/relu"
  type: "ReLU"
  bottom: "stem3"
  top: "stem3"
}
layer {
  name: "stage1_1/branch1"
  type: "Convolution"
  bottom: "stem3"
  top: "stage1_1/branch1"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_1/branch1/bn"
  type: "BatchNorm"
  bottom: "stage1_1/branch1"
  top: "stage1_1/branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_1/branch1/scale"
  type: "Scale"
  bottom: "stage1_1/branch1"
  top: "stage1_1/branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_1/branch1/relu"
  type: "ReLU"
  bottom: "stage1_1/branch1"
  top: "stage1_1/branch1"
}
layer {
  name: "stage1_1/branch2a"
  type: "Convolution"
  bottom: "stem3"
  top: "stage1_1/branch2a"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_1/branch2a/bn"
  type: "BatchNorm"
  bottom: "stage1_1/branch2a"
  top: "stage1_1/branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_1/branch2a/scale"
  type: "Scale"
  bottom: "stage1_1/branch2a"
  top: "stage1_1/branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_1/branch2a/relu"
  type: "ReLU"
  bottom: "stage1_1/branch2a"
  top: "stage1_1/branch2a"
}
layer {
  name: "stage1_1/branch2b"
  type: "Convolution"
  bottom: "stage1_1/branch2a"
  top: "stage1_1/branch2b"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_1/branch2b/bn"
  type: "BatchNorm"
  bottom: "stage1_1/branch2b"
  top: "stage1_1/branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_1/branch2b/scale"
  type: "Scale"
  bottom: "stage1_1/branch2b"
  top: "stage1_1/branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_1/branch2b/relu"
  type: "ReLU"
  bottom: "stage1_1/branch2b"
  top: "stage1_1/branch2b"
}
layer {
  name: "stage1_1/branch3a"
  type: "Convolution"
  bottom: "stem3"
  top: "stage1_1/branch3a"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_1/branch3a/bn"
  type: "BatchNorm"
  bottom: "stage1_1/branch3a"
  top: "stage1_1/branch3a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_1/branch3a/scale"
  type: "Scale"
  bottom: "stage1_1/branch3a"
  top: "stage1_1/branch3a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_1/branch3a/relu"
  type: "ReLU"
  bottom: "stage1_1/branch3a"
  top: "stage1_1/branch3a"
}
layer {
  name: "stage1_1/branch3b"
  type: "Convolution"
  bottom: "stage1_1/branch3a"
  top: "stage1_1/branch3b"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_1/branch3b/bn"
  type: "BatchNorm"
  bottom: "stage1_1/branch3b"
  top: "stage1_1/branch3b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_1/branch3b/scale"
  type: "Scale"
  bottom: "stage1_1/branch3b"
  top: "stage1_1/branch3b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_1/branch3b/relu"
  type: "ReLU"
  bottom: "stage1_1/branch3b"
  top: "stage1_1/branch3b"
}
layer {
  name: "stage1_1/branch3c"
  type: "Convolution"
  bottom: "stage1_1/branch3b"
  top: "stage1_1/branch3c"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_1/branch3c/bn"
  type: "BatchNorm"
  bottom: "stage1_1/branch3c"
  top: "stage1_1/branch3c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_1/branch3c/scale"
  type: "Scale"
  bottom: "stage1_1/branch3c"
  top: "stage1_1/branch3c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_1/branch3c/relu"
  type: "ReLU"
  bottom: "stage1_1/branch3c"
  top: "stage1_1/branch3c"
}
layer {
  name: "stage1_1/eltwise"
  type: "Eltwise"
  bottom: "stage1_1/branch1"
  bottom: "stage1_1/branch2b"
  bottom: "stage1_1/branch3c"
  top: "stage1_1/eltwise"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "stage1_1/concat"
  type: "Concat"
  bottom: "stem3"
  bottom: "stage1_1/eltwise"
  top: "stage1_1/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage1_2/branch1"
  type: "Convolution"
  bottom: "stage1_1/concat"
  top: "stage1_2/branch1"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_2/branch1/bn"
  type: "BatchNorm"
  bottom: "stage1_2/branch1"
  top: "stage1_2/branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_2/branch1/scale"
  type: "Scale"
  bottom: "stage1_2/branch1"
  top: "stage1_2/branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_2/branch1/relu"
  type: "ReLU"
  bottom: "stage1_2/branch1"
  top: "stage1_2/branch1"
}
layer {
  name: "stage1_2/branch2a"
  type: "Convolution"
  bottom: "stage1_1/concat"
  top: "stage1_2/branch2a"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_2/branch2a/bn"
  type: "BatchNorm"
  bottom: "stage1_2/branch2a"
  top: "stage1_2/branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_2/branch2a/scale"
  type: "Scale"
  bottom: "stage1_2/branch2a"
  top: "stage1_2/branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_2/branch2a/relu"
  type: "ReLU"
  bottom: "stage1_2/branch2a"
  top: "stage1_2/branch2a"
}
layer {
  name: "stage1_2/branch2b"
  type: "Convolution"
  bottom: "stage1_2/branch2a"
  top: "stage1_2/branch2b"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_2/branch2b/bn"
  type: "BatchNorm"
  bottom: "stage1_2/branch2b"
  top: "stage1_2/branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_2/branch2b/scale"
  type: "Scale"
  bottom: "stage1_2/branch2b"
  top: "stage1_2/branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_2/branch2b/relu"
  type: "ReLU"
  bottom: "stage1_2/branch2b"
  top: "stage1_2/branch2b"
}
layer {
  name: "stage1_2/branch3a"
  type: "Convolution"
  bottom: "stage1_1/concat"
  top: "stage1_2/branch3a"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_2/branch3a/bn"
  type: "BatchNorm"
  bottom: "stage1_2/branch3a"
  top: "stage1_2/branch3a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_2/branch3a/scale"
  type: "Scale"
  bottom: "stage1_2/branch3a"
  top: "stage1_2/branch3a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_2/branch3a/relu"
  type: "ReLU"
  bottom: "stage1_2/branch3a"
  top: "stage1_2/branch3a"
}
layer {
  name: "stage1_2/branch3b"
  type: "Convolution"
  bottom: "stage1_2/branch3a"
  top: "stage1_2/branch3b"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_2/branch3b/bn"
  type: "BatchNorm"
  bottom: "stage1_2/branch3b"
  top: "stage1_2/branch3b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_2/branch3b/scale"
  type: "Scale"
  bottom: "stage1_2/branch3b"
  top: "stage1_2/branch3b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_2/branch3b/relu"
  type: "ReLU"
  bottom: "stage1_2/branch3b"
  top: "stage1_2/branch3b"
}
layer {
  name: "stage1_2/branch3c"
  type: "Convolution"
  bottom: "stage1_2/branch3b"
  top: "stage1_2/branch3c"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_2/branch3c/bn"
  type: "BatchNorm"
  bottom: "stage1_2/branch3c"
  top: "stage1_2/branch3c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_2/branch3c/scale"
  type: "Scale"
  bottom: "stage1_2/branch3c"
  top: "stage1_2/branch3c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_2/branch3c/relu"
  type: "ReLU"
  bottom: "stage1_2/branch3c"
  top: "stage1_2/branch3c"
}
layer {
  name: "stage1_2/eltwise"
  type: "Eltwise"
  bottom: "stage1_2/branch1"
  bottom: "stage1_2/branch2b"
  bottom: "stage1_2/branch3c"
  top: "stage1_2/eltwise"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "stage1_2/concat"
  type: "Concat"
  bottom: "stage1_1/concat"
  bottom: "stage1_2/eltwise"
  top: "stage1_2/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage1_3/branch1"
  type: "Convolution"
  bottom: "stage1_2/concat"
  top: "stage1_3/branch1"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_3/branch1/bn"
  type: "BatchNorm"
  bottom: "stage1_3/branch1"
  top: "stage1_3/branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_3/branch1/scale"
  type: "Scale"
  bottom: "stage1_3/branch1"
  top: "stage1_3/branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_3/branch1/relu"
  type: "ReLU"
  bottom: "stage1_3/branch1"
  top: "stage1_3/branch1"
}
layer {
  name: "stage1_3/branch2a"
  type: "Convolution"
  bottom: "stage1_2/concat"
  top: "stage1_3/branch2a"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_3/branch2a/bn"
  type: "BatchNorm"
  bottom: "stage1_3/branch2a"
  top: "stage1_3/branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_3/branch2a/scale"
  type: "Scale"
  bottom: "stage1_3/branch2a"
  top: "stage1_3/branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_3/branch2a/relu"
  type: "ReLU"
  bottom: "stage1_3/branch2a"
  top: "stage1_3/branch2a"
}
layer {
  name: "stage1_3/branch2b"
  type: "Convolution"
  bottom: "stage1_3/branch2a"
  top: "stage1_3/branch2b"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_3/branch2b/bn"
  type: "BatchNorm"
  bottom: "stage1_3/branch2b"
  top: "stage1_3/branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_3/branch2b/scale"
  type: "Scale"
  bottom: "stage1_3/branch2b"
  top: "stage1_3/branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_3/branch2b/relu"
  type: "ReLU"
  bottom: "stage1_3/branch2b"
  top: "stage1_3/branch2b"
}
layer {
  name: "stage1_3/branch3a"
  type: "Convolution"
  bottom: "stage1_2/concat"
  top: "stage1_3/branch3a"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_3/branch3a/bn"
  type: "BatchNorm"
  bottom: "stage1_3/branch3a"
  top: "stage1_3/branch3a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_3/branch3a/scale"
  type: "Scale"
  bottom: "stage1_3/branch3a"
  top: "stage1_3/branch3a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_3/branch3a/relu"
  type: "ReLU"
  bottom: "stage1_3/branch3a"
  top: "stage1_3/branch3a"
}
layer {
  name: "stage1_3/branch3b"
  type: "Convolution"
  bottom: "stage1_3/branch3a"
  top: "stage1_3/branch3b"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_3/branch3b/bn"
  type: "BatchNorm"
  bottom: "stage1_3/branch3b"
  top: "stage1_3/branch3b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_3/branch3b/scale"
  type: "Scale"
  bottom: "stage1_3/branch3b"
  top: "stage1_3/branch3b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_3/branch3b/relu"
  type: "ReLU"
  bottom: "stage1_3/branch3b"
  top: "stage1_3/branch3b"
}
layer {
  name: "stage1_3/branch3c"
  type: "Convolution"
  bottom: "stage1_3/branch3b"
  top: "stage1_3/branch3c"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_3/branch3c/bn"
  type: "BatchNorm"
  bottom: "stage1_3/branch3c"
  top: "stage1_3/branch3c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_3/branch3c/scale"
  type: "Scale"
  bottom: "stage1_3/branch3c"
  top: "stage1_3/branch3c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_3/branch3c/relu"
  type: "ReLU"
  bottom: "stage1_3/branch3c"
  top: "stage1_3/branch3c"
}
layer {
  name: "stage1_3/eltwise"
  type: "Eltwise"
  bottom: "stage1_3/branch1"
  bottom: "stage1_3/branch2b"
  bottom: "stage1_3/branch3c"
  top: "stage1_3/eltwise"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "stage1_3/concat"
  type: "Concat"
  bottom: "stage1_2/concat"
  bottom: "stage1_3/eltwise"
  top: "stage1_3/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage1_tb"
  type: "Convolution"
  bottom: "stage1_3/concat"
  top: "stage1_tb"
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage1_tb/bn"
  type: "BatchNorm"
  bottom: "stage1_tb"
  top: "stage1_tb"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage1_tb/scale"
  type: "Scale"
  bottom: "stage1_tb"
  top: "stage1_tb"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage1_tb/relu"
  type: "ReLU"
  bottom: "stage1_tb"
  top: "stage1_tb"
}
layer {
  name: "stage1_tb/pool"
  type: "Pooling"
  bottom: "stage1_tb"
  top: "stage1_tb/pool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "stage2_1/branch1"
  type: "Convolution"
  bottom: "stage1_tb/pool"
  top: "stage2_1/branch1"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_1/branch1/bn"
  type: "BatchNorm"
  bottom: "stage2_1/branch1"
  top: "stage2_1/branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_1/branch1/scale"
  type: "Scale"
  bottom: "stage2_1/branch1"
  top: "stage2_1/branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_1/branch1/relu"
  type: "ReLU"
  bottom: "stage2_1/branch1"
  top: "stage2_1/branch1"
}
layer {
  name: "stage2_1/branch2a"
  type: "Convolution"
  bottom: "stage1_tb/pool"
  top: "stage2_1/branch2a"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_1/branch2a/bn"
  type: "BatchNorm"
  bottom: "stage2_1/branch2a"
  top: "stage2_1/branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_1/branch2a/scale"
  type: "Scale"
  bottom: "stage2_1/branch2a"
  top: "stage2_1/branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_1/branch2a/relu"
  type: "ReLU"
  bottom: "stage2_1/branch2a"
  top: "stage2_1/branch2a"
}
layer {
  name: "stage2_1/branch2b"
  type: "Convolution"
  bottom: "stage2_1/branch2a"
  top: "stage2_1/branch2b"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_1/branch2b/bn"
  type: "BatchNorm"
  bottom: "stage2_1/branch2b"
  top: "stage2_1/branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_1/branch2b/scale"
  type: "Scale"
  bottom: "stage2_1/branch2b"
  top: "stage2_1/branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_1/branch2b/relu"
  type: "ReLU"
  bottom: "stage2_1/branch2b"
  top: "stage2_1/branch2b"
}
layer {
  name: "stage2_1/branch3a"
  type: "Convolution"
  bottom: "stage1_tb/pool"
  top: "stage2_1/branch3a"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_1/branch3a/bn"
  type: "BatchNorm"
  bottom: "stage2_1/branch3a"
  top: "stage2_1/branch3a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_1/branch3a/scale"
  type: "Scale"
  bottom: "stage2_1/branch3a"
  top: "stage2_1/branch3a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_1/branch3a/relu"
  type: "ReLU"
  bottom: "stage2_1/branch3a"
  top: "stage2_1/branch3a"
}
layer {
  name: "stage2_1/branch3b"
  type: "Convolution"
  bottom: "stage2_1/branch3a"
  top: "stage2_1/branch3b"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_1/branch3b/bn"
  type: "BatchNorm"
  bottom: "stage2_1/branch3b"
  top: "stage2_1/branch3b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_1/branch3b/scale"
  type: "Scale"
  bottom: "stage2_1/branch3b"
  top: "stage2_1/branch3b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_1/branch3b/relu"
  type: "ReLU"
  bottom: "stage2_1/branch3b"
  top: "stage2_1/branch3b"
}
layer {
  name: "stage2_1/branch3c"
  type: "Convolution"
  bottom: "stage2_1/branch3b"
  top: "stage2_1/branch3c"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_1/branch3c/bn"
  type: "BatchNorm"
  bottom: "stage2_1/branch3c"
  top: "stage2_1/branch3c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_1/branch3c/scale"
  type: "Scale"
  bottom: "stage2_1/branch3c"
  top: "stage2_1/branch3c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_1/branch3c/relu"
  type: "ReLU"
  bottom: "stage2_1/branch3c"
  top: "stage2_1/branch3c"
}
layer {
  name: "stage2_1/eltwise"
  type: "Eltwise"
  bottom: "stage2_1/branch1"
  bottom: "stage2_1/branch2b"
  bottom: "stage2_1/branch3c"
  top: "stage2_1/eltwise"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "stage2_1/concat"
  type: "Concat"
  bottom: "stage1_tb/pool"
  bottom: "stage2_1/eltwise"
  top: "stage2_1/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage2_2/branch1"
  type: "Convolution"
  bottom: "stage2_1/concat"
  top: "stage2_2/branch1"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_2/branch1/bn"
  type: "BatchNorm"
  bottom: "stage2_2/branch1"
  top: "stage2_2/branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_2/branch1/scale"
  type: "Scale"
  bottom: "stage2_2/branch1"
  top: "stage2_2/branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_2/branch1/relu"
  type: "ReLU"
  bottom: "stage2_2/branch1"
  top: "stage2_2/branch1"
}
layer {
  name: "stage2_2/branch2a"
  type: "Convolution"
  bottom: "stage2_1/concat"
  top: "stage2_2/branch2a"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_2/branch2a/bn"
  type: "BatchNorm"
  bottom: "stage2_2/branch2a"
  top: "stage2_2/branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_2/branch2a/scale"
  type: "Scale"
  bottom: "stage2_2/branch2a"
  top: "stage2_2/branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_2/branch2a/relu"
  type: "ReLU"
  bottom: "stage2_2/branch2a"
  top: "stage2_2/branch2a"
}
layer {
  name: "stage2_2/branch2b"
  type: "Convolution"
  bottom: "stage2_2/branch2a"
  top: "stage2_2/branch2b"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_2/branch2b/bn"
  type: "BatchNorm"
  bottom: "stage2_2/branch2b"
  top: "stage2_2/branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_2/branch2b/scale"
  type: "Scale"
  bottom: "stage2_2/branch2b"
  top: "stage2_2/branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_2/branch2b/relu"
  type: "ReLU"
  bottom: "stage2_2/branch2b"
  top: "stage2_2/branch2b"
}
layer {
  name: "stage2_2/branch3a"
  type: "Convolution"
  bottom: "stage2_1/concat"
  top: "stage2_2/branch3a"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_2/branch3a/bn"
  type: "BatchNorm"
  bottom: "stage2_2/branch3a"
  top: "stage2_2/branch3a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_2/branch3a/scale"
  type: "Scale"
  bottom: "stage2_2/branch3a"
  top: "stage2_2/branch3a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_2/branch3a/relu"
  type: "ReLU"
  bottom: "stage2_2/branch3a"
  top: "stage2_2/branch3a"
}
layer {
  name: "stage2_2/branch3b"
  type: "Convolution"
  bottom: "stage2_2/branch3a"
  top: "stage2_2/branch3b"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_2/branch3b/bn"
  type: "BatchNorm"
  bottom: "stage2_2/branch3b"
  top: "stage2_2/branch3b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_2/branch3b/scale"
  type: "Scale"
  bottom: "stage2_2/branch3b"
  top: "stage2_2/branch3b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_2/branch3b/relu"
  type: "ReLU"
  bottom: "stage2_2/branch3b"
  top: "stage2_2/branch3b"
}
layer {
  name: "stage2_2/branch3c"
  type: "Convolution"
  bottom: "stage2_2/branch3b"
  top: "stage2_2/branch3c"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_2/branch3c/bn"
  type: "BatchNorm"
  bottom: "stage2_2/branch3c"
  top: "stage2_2/branch3c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_2/branch3c/scale"
  type: "Scale"
  bottom: "stage2_2/branch3c"
  top: "stage2_2/branch3c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_2/branch3c/relu"
  type: "ReLU"
  bottom: "stage2_2/branch3c"
  top: "stage2_2/branch3c"
}
layer {
  name: "stage2_2/eltwise"
  type: "Eltwise"
  bottom: "stage2_2/branch1"
  bottom: "stage2_2/branch2b"
  bottom: "stage2_2/branch3c"
  top: "stage2_2/eltwise"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "stage2_2/concat"
  type: "Concat"
  bottom: "stage2_1/concat"
  bottom: "stage2_2/eltwise"
  top: "stage2_2/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage2_3/branch1"
  type: "Convolution"
  bottom: "stage2_2/concat"
  top: "stage2_3/branch1"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_3/branch1/bn"
  type: "BatchNorm"
  bottom: "stage2_3/branch1"
  top: "stage2_3/branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_3/branch1/scale"
  type: "Scale"
  bottom: "stage2_3/branch1"
  top: "stage2_3/branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_3/branch1/relu"
  type: "ReLU"
  bottom: "stage2_3/branch1"
  top: "stage2_3/branch1"
}
layer {
  name: "stage2_3/branch2a"
  type: "Convolution"
  bottom: "stage2_2/concat"
  top: "stage2_3/branch2a"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_3/branch2a/bn"
  type: "BatchNorm"
  bottom: "stage2_3/branch2a"
  top: "stage2_3/branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_3/branch2a/scale"
  type: "Scale"
  bottom: "stage2_3/branch2a"
  top: "stage2_3/branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_3/branch2a/relu"
  type: "ReLU"
  bottom: "stage2_3/branch2a"
  top: "stage2_3/branch2a"
}
layer {
  name: "stage2_3/branch2b"
  type: "Convolution"
  bottom: "stage2_3/branch2a"
  top: "stage2_3/branch2b"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_3/branch2b/bn"
  type: "BatchNorm"
  bottom: "stage2_3/branch2b"
  top: "stage2_3/branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_3/branch2b/scale"
  type: "Scale"
  bottom: "stage2_3/branch2b"
  top: "stage2_3/branch2b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_3/branch2b/relu"
  type: "ReLU"
  bottom: "stage2_3/branch2b"
  top: "stage2_3/branch2b"
}
layer {
  name: "stage2_3/branch3a"
  type: "Convolution"
  bottom: "stage2_2/concat"
  top: "stage2_3/branch3a"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_3/branch3a/bn"
  type: "BatchNorm"
  bottom: "stage2_3/branch3a"
  top: "stage2_3/branch3a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_3/branch3a/scale"
  type: "Scale"
  bottom: "stage2_3/branch3a"
  top: "stage2_3/branch3a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_3/branch3a/relu"
  type: "ReLU"
  bottom: "stage2_3/branch3a"
  top: "stage2_3/branch3a"
}
layer {
  name: "stage2_3/branch3b"
  type: "Convolution"
  bottom: "stage2_3/branch3a"
  top: "stage2_3/branch3b"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_3/branch3b/bn"
  type: "BatchNorm"
  bottom: "stage2_3/branch3b"
  top: "stage2_3/branch3b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_3/branch3b/scale"
  type: "Scale"
  bottom: "stage2_3/branch3b"
  top: "stage2_3/branch3b"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_3/branch3b/relu"
  type: "ReLU"
  bottom: "stage2_3/branch3b"
  top: "stage2_3/branch3b"
}
layer {
  name: "stage2_3/branch3c"
  type: "Convolution"
  bottom: "stage2_3/branch3b"
  top: "stage2_3/branch3c"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_3/branch3c/bn"
  type: "BatchNorm"
  bottom: "stage2_3/branch3c"
  top: "stage2_3/branch3c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_3/branch3c/scale"
  type: "Scale"
  bottom: "stage2_3/branch3c"
  top: "stage2_3/branch3c"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_3/branch3c/relu"
  type: "ReLU"
  bottom: "stage2_3/branch3c"
  top: "stage2_3/branch3c"
}
layer {
  name: "stage2_3/eltwise"
  type: "Eltwise"
  bottom: "stage2_3/branch1"
  bottom: "stage2_3/branch2b"
  bottom: "stage2_3/branch3c"
  top: "stage2_3/eltwise"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "stage2_3/concat"
  type: "Concat"
  bottom: "stage2_2/concat"
  bottom: "stage2_3/eltwise"
  top: "stage2_3/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "stage2_4/branch1"
  type: "Convolution"
  bottom: "stage2_3/concat"
  top: "stage2_4/branch1"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_4/branch1/bn"
  type: "BatchNorm"
  bottom: "stage2_4/branch1"
  top: "stage2_4/branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_4/branch1/scale"
  type: "Scale"
  bottom: "stage2_4/branch1"
  top: "stage2_4/branch1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_4/branch1/relu"
  type: "ReLU"
  bottom: "stage2_4/branch1"
  top: "stage2_4/branch1"
}
layer {
  name: "stage2_4/branch2a"
  type: "Convolution"
  bottom: "stage2_3/concat"
  top: "stage2_4/branch2a"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "stage2_4/branch2a/bn"
  type: "BatchNorm"
  bottom: "stage2_4/branch2a"
  top: "stage2_4/branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    moving_average_fraction: 0.999
    eps: 0.001
  }
}
layer {
  name: "stage2_4/branch2a/scale"
  type: "Scale"
  bottom: "stage2_4/branch2a"
  top: "stage2_4/branch2a"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "stage2_4/branch2a/relu"
  type: "ReLU"
  bottom: "stage2_4/branch2a"
  top: "stage2_4/branch2a"
}
layer {
  name: "stage2_4/branch2b"
  type: "Convolution"
  bottom: "stage2_4/branch2a"
  top: "stage2_4/branch2b"
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
